// Завдання 2

// Створіть функцію яка приймає один параметр: num.
// Усередині функції виведіть значення num в консоль.
// Після цього, рекурсивно викличте функцію зі зменшеним значенням num(наприклад, num - 1).
// Функція повинна викликатися, доки num не стане менше або рівне 0.
// Викличте вашу функцію з аргументом, наприклад, 5, щоб почати рекурсивний лічильник.

function countDown(num) {
	if (typeof num !== "number" || num < 0) {
		console.log("Error: Num must be a non-negative number")
		return
	}

	console.log(num)

	if (num > 0) {
		countDown(num - 1)
	}
};

countDown(5)