// 1. Створіть об'єкт car1 з такими властивостями:
// 	- brand: рядок, представляє марку автомобіля.
// 	- model: рядок, представляє модель автомобіля.
// 	- year: число, представляє рік випуску автомобіля.
// 2. Створіть об'єкт car2 з такими властивостями:
// 	- brand: рядок, представляє марку автомобіля.
// 	- model: рядок, представляє модель автомобіля.
// 	- owner: число, представляє рік випуску автомобіля.
// 3. Створіть об'єкт car3. Використайте оператор spread щоб додати всі властивості що є в car1 та car2 до об'єкту car3.
// 4. Виведіть об'єкт car3 в консоль.

type Car = {
	brand: string;
	model: string;
	year?: number;
	owner?: number
}

const car1: Car = {
	brand: "BMW",
	model: "X5",
	year: 2010
};

const car2: Car = {
	brand: "AUDI",
	model: "Q3",
	owner: 2015
}

const car3: Car = { ...car1, ...car2 };
console.log(car3)

// !!! Можливо помилка в завданні. Можливо owner повинно бути не "число" а "рядок" ?